In [1]:
import pandas as pd

первая часть

In [2]:
df = pd.read_csv('/Users/sidorovegor/Downloads/tested.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [4]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [5]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
df.select_dtypes(include=['int64', 'float64']).describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [7]:
df.shape

(418, 12)

заполнение пропусков

In [8]:
df.fillna({'Age': df['Age'].mean()}, inplace=True)

In [9]:
df['Age'].isna().sum()

np.int64(0)

In [10]:
df.drop(labels=['Cabin'], inplace=True, axis=1)

In [11]:
df.shape

(418, 11)

вторая часть

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

процент выживших мужчин и женщин

In [14]:
am = df[(df['Sex'] == 'male') & (df['Survived'] == 1)]
aw = df[(df['Sex'] == 'female') & (df['Survived'] == 1)]
am.shape, aw.shape  # выживших мужчин нет

((0, 11), (152, 11))

средний возраст мужчин и женщин

In [15]:
mm = df['Age'][df['Sex'] == 'male'].mean()
mw = df['Age'][df['Sex'] == 'female'].mean()
mm, mw

(np.float64(30.272699293414263), np.float64(30.27239973050095))

средний возраст выживших и погибших мужчин и женщин

In [16]:
mam = df['Age'][df['Sex'] == 'male'][df['Survived'] == 1].mean()
mdm = df['Age'][df['Sex'] == 'male'][df['Survived'] == 0].mean()

wam = df['Age'][df['Sex'] == 'female'][df['Survived'] == 1].mean()
wdm = df['Age'][df['Sex'] == 'female'][df['Survived'] == 0].mean()

mam, mdm, wam, wdm  # тк все мужчины умерли, а все мужчины выжили

(nan, np.float64(30.272699293414263), np.float64(30.27239973050095), nan)

группировка таблицы

In [17]:
new = df.groupby(["Pclass", 'Sex']).agg({'Age':'mean', 'Fare':'mean', "Survived":"mean"}).reset_index()
new

   Pclass     Sex        Age        Fare  Survived
0       1  female  40.890904  115.591168       1.0
1       1    male  39.261546   75.586551       0.0
2       2  female  24.573086   26.438750       1.0
3       2    male  30.898260   20.184654       0.0
4       3  female  25.273153   13.735129       1.0
5       3    male  26.493421   11.826350       0.0

3 задание

In [18]:
df[(df['Age'] > 30) & (df['Sex'] == 'male') & (df['Pclass'] == 1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
11,903,0,1,"Jones, Mr. Charles Cresson",male,46.00000,0,0,694,26.00,S
20,912,0,1,"Rothschild, Mr. Martin",male,55.00000,1,0,PC 17603,59.40,C
28,920,0,1,"Brady, Mr. John Bertram",male,41.00000,0,0,113054,30.50,S
41,933,0,1,"Franklin, Mr. Thomas Parham",male,30.27259,0,0,113778,26.55,S
46,938,0,1,"Chevre, Mr. Paul Romaine",male,45.00000,0,0,PC 17594,29.70,C

In [19]:
df[((df['Age'] < 18) | (df['Sex'] == 'female')) & (df['Survived'] == 0)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,S
21,913,0,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,S
55,947,0,3,"Rice, Master. Albert",male,10.0,4,1,382652,29.1250,Q
60,952,0,3,"Dika, Mr. Mirko",male,17.0,0,0,349232,7.8958,S
64,956,0,1,"Ryerson, Master. John Borie",male,13.0,2,2,PC 17608,262.3750,C

In [20]:
df.to_csv('tested_prepared.csv', index=False)